Revit 2027 API
BuiltInFailures.FabricFailures.CannotPlaceFabricSheet Property
 Can't find a host for Fabric Sheet.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotPlaceFabricSheet { get; }
Public Shared ReadOnly Property CannotPlaceFabricSheet As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotPlaceFabricSheet {
	FailureDefinitionId^ get ();
}
static member CannotPlaceFabricSheet : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FabricFailures Class
Autodesk.Revit.DB Namespace